luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxHsct_bf.h
/** \brief  Mask for Ifx_HSCT_ACCEN0_Bits.EN25 */
#define IFX_HSCT_ACCEN0_EN25_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_ACCEN0_Bits.EN25 */
#define IFX_HSCT_ACCEN0_EN25_OFF (25u)

/** \brief  Length for Ifx_HSCT_ACCEN0_Bits.EN26 */
#define IFX_HSCT_ACCEN0_EN26_LEN (1u)

/** \brief  Mask for Ifx_HSCT_ACCEN0_Bits.EN26 */
#define IFX_HSCT_ACCEN0_EN26_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_ACCEN0_Bits.EN26 */
#define IFX_HSCT_ACCEN0_EN26_OFF (26u)

/** \brief  Length for Ifx_HSCT_ACCEN0_Bits.EN27 */
#define IFX_HSCT_ACCEN0_EN27_LEN (1u)

/** \brief  Mask for Ifx_HSCT_ACCEN0_Bits.EN27 */
#define IFX_HSCT_ACCEN0_EN27_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_ACCEN0_Bits.EN27 */
#define IFX_HSCT_ACCEN0_EN27_OFF (27u)

/** \brief  Length for Ifx_HSCT_ACCEN0_Bits.EN28 */
#define IFX_HSCT_ACCEN0_EN28_LEN (1u)

/** \brief  Mask for Ifx_HSCT_ACCEN0_Bits.EN28 */
#define IFX_HSCT_ACCEN0_EN28_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_ACCEN0_Bits.EN28 */
#define IFX_HSCT_ACCEN0_EN28_OFF (28u)

/** \brief  Length for Ifx_HSCT_ACCEN0_Bits.EN29 */
#define IFX_HSCT_ACCEN0_EN29_LEN (1u)

/** \brief  Mask for Ifx_HSCT_ACCEN0_Bits.EN29 */
#define IFX_HSCT_ACCEN0_EN29_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_ACCEN0_Bits.EN29 */
#define IFX_HSCT_ACCEN0_EN29_OFF (29u)

/** \brief  Length for Ifx_HSCT_ACCEN0_Bits.EN2 */
#define IFX_HSCT_ACCEN0_EN2_LEN (1u)

/** \brief  Mask for Ifx_HSCT_ACCEN0_Bits.EN2 */
#define IFX_HSCT_ACCEN0_EN2_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_ACCEN0_Bits.EN2 */
#define IFX_HSCT_ACCEN0_EN2_OFF (2u)

/** \brief  Length for Ifx_HSCT_ACCEN0_Bits.EN30 */
#define IFX_HSCT_ACCEN0_EN30_LEN (1u)

/** \brief  Mask for Ifx_HSCT_ACCEN0_Bits.EN30 */
#define IFX_HSCT_ACCEN0_EN30_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_ACCEN0_Bits.EN30 */
#define IFX_HSCT_ACCEN0_EN30_OFF (30u)

/** \brief  Length for Ifx_HSCT_ACCEN0_Bits.EN31 */
#define IFX_HSCT_ACCEN0_EN31_LEN (1u)

/** \brief  Mask for Ifx_HSCT_ACCEN0_Bits.EN31 */
#define IFX_HSCT_ACCEN0_EN31_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_ACCEN0_Bits.EN31 */
#define IFX_HSCT_ACCEN0_EN31_OFF (31u)

/** \brief  Length for Ifx_HSCT_ACCEN0_Bits.EN3 */
#define IFX_HSCT_ACCEN0_EN3_LEN (1u)

/** \brief  Mask for Ifx_HSCT_ACCEN0_Bits.EN3 */
#define IFX_HSCT_ACCEN0_EN3_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_ACCEN0_Bits.EN3 */
#define IFX_HSCT_ACCEN0_EN3_OFF (3u)

/** \brief  Length for Ifx_HSCT_ACCEN0_Bits.EN4 */
#define IFX_HSCT_ACCEN0_EN4_LEN (1u)

/** \brief  Mask for Ifx_HSCT_ACCEN0_Bits.EN4 */
#define IFX_HSCT_ACCEN0_EN4_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_ACCEN0_Bits.EN4 */
#define IFX_HSCT_ACCEN0_EN4_OFF (4u)

/** \brief  Length for Ifx_HSCT_ACCEN0_Bits.EN5 */
#define IFX_HSCT_ACCEN0_EN5_LEN (1u)

/** \brief  Mask for Ifx_HSCT_ACCEN0_Bits.EN5 */
#define IFX_HSCT_ACCEN0_EN5_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_ACCEN0_Bits.EN5 */
#define IFX_HSCT_ACCEN0_EN5_OFF (5u)

/** \brief  Length for Ifx_HSCT_ACCEN0_Bits.EN6 */
#define IFX_HSCT_ACCEN0_EN6_LEN (1u)

/** \brief  Mask for Ifx_HSCT_ACCEN0_Bits.EN6 */
#define IFX_HSCT_ACCEN0_EN6_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_ACCEN0_Bits.EN6 */
#define IFX_HSCT_ACCEN0_EN6_OFF (6u)

/** \brief  Length for Ifx_HSCT_ACCEN0_Bits.EN7 */
#define IFX_HSCT_ACCEN0_EN7_LEN (1u)

/** \brief  Mask for Ifx_HSCT_ACCEN0_Bits.EN7 */
#define IFX_HSCT_ACCEN0_EN7_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_ACCEN0_Bits.EN7 */
#define IFX_HSCT_ACCEN0_EN7_OFF (7u)

/** \brief  Length for Ifx_HSCT_ACCEN0_Bits.EN8 */
#define IFX_HSCT_ACCEN0_EN8_LEN (1u)

/** \brief  Mask for Ifx_HSCT_ACCEN0_Bits.EN8 */
#define IFX_HSCT_ACCEN0_EN8_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_ACCEN0_Bits.EN8 */
#define IFX_HSCT_ACCEN0_EN8_OFF (8u)

/** \brief  Length for Ifx_HSCT_ACCEN0_Bits.EN9 */
#define IFX_HSCT_ACCEN0_EN9_LEN (1u)

/** \brief  Mask for Ifx_HSCT_ACCEN0_Bits.EN9 */
#define IFX_HSCT_ACCEN0_EN9_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_ACCEN0_Bits.EN9 */
#define IFX_HSCT_ACCEN0_EN9_OFF (9u)

/** \brief  Length for Ifx_HSCT_CLC_Bits.DISR */
#define IFX_HSCT_CLC_DISR_LEN (1u)

/** \brief  Mask for Ifx_HSCT_CLC_Bits.DISR */
#define IFX_HSCT_CLC_DISR_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_CLC_Bits.DISR */
#define IFX_HSCT_CLC_DISR_OFF (0u)

/** \brief  Length for Ifx_HSCT_CLC_Bits.DISS */
#define IFX_HSCT_CLC_DISS_LEN (1u)

/** \brief  Mask for Ifx_HSCT_CLC_Bits.DISS */
#define IFX_HSCT_CLC_DISS_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_CLC_Bits.DISS */
#define IFX_HSCT_CLC_DISS_OFF (1u)

/** \brief  Length for Ifx_HSCT_CLC_Bits.EDIS */
#define IFX_HSCT_CLC_EDIS_LEN (1u)

/** \brief  Mask for Ifx_HSCT_CLC_Bits.EDIS */
#define IFX_HSCT_CLC_EDIS_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_CLC_Bits.EDIS */
#define IFX_HSCT_CLC_EDIS_OFF (3u)

/** \brief  Length for Ifx_HSCT_CONFIGPHY_Bits.OSCCLKEN */
#define IFX_HSCT_CONFIGPHY_OSCCLKEN_LEN (1u)

/** \brief  Mask for Ifx_HSCT_CONFIGPHY_Bits.OSCCLKEN */
#define IFX_HSCT_CONFIGPHY_OSCCLKEN_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_CONFIGPHY_Bits.OSCCLKEN */
#define IFX_HSCT_CONFIGPHY_OSCCLKEN_OFF (28u)

/** \brief  Length for Ifx_HSCT_CONFIGPHY_Bits.PHYRST */
#define IFX_HSCT_CONFIGPHY_PHYRST_LEN (1u)

/** \brief  Mask for Ifx_HSCT_CONFIGPHY_Bits.PHYRST */
#define IFX_HSCT_CONFIGPHY_PHYRST_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_CONFIGPHY_Bits.PHYRST */
#define IFX_HSCT_CONFIGPHY_PHYRST_OFF (15u)

/** \brief  Length for Ifx_HSCT_CONFIGPHY_Bits.PLLIVR */
#define IFX_HSCT_CONFIGPHY_PLLIVR_LEN (4u)

/** \brief  Mask for Ifx_HSCT_CONFIGPHY_Bits.PLLIVR */
#define IFX_HSCT_CONFIGPHY_PLLIVR_MSK (0xfu)

/** \brief  Offset for Ifx_HSCT_CONFIGPHY_Bits.PLLIVR */
#define IFX_HSCT_CONFIGPHY_PLLIVR_OFF (22u)

/** \brief  Length for Ifx_HSCT_CONFIGPHY_Bits.PLLKI */
#define IFX_HSCT_CONFIGPHY_PLLKI_LEN (3u)

/** \brief  Mask for Ifx_HSCT_CONFIGPHY_Bits.PLLKI */
#define IFX_HSCT_CONFIGPHY_PLLKI_MSK (0x7u)

/** \brief  Offset for Ifx_HSCT_CONFIGPHY_Bits.PLLKI */
#define IFX_HSCT_CONFIGPHY_PLLKI_OFF (19u)

/** \brief  Length for Ifx_HSCT_CONFIGPHY_Bits.PLLKP */
#define IFX_HSCT_CONFIGPHY_PLLKP_LEN (3u)

/** \brief  Mask for Ifx_HSCT_CONFIGPHY_Bits.PLLKP */
#define IFX_HSCT_CONFIGPHY_PLLKP_MSK (0x7u)

