luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxHsct_bf.h
/** \brief  Offset for Ifx_HSCT_CONFIGPHY_Bits.PLLKP */
#define IFX_HSCT_CONFIGPHY_PLLKP_OFF (16u)

/** \brief  Length for Ifx_HSCT_CONFIGPHY_Bits.PLLKPKI */
#define IFX_HSCT_CONFIGPHY_PLLKPKI_LEN (1u)

/** \brief  Mask for Ifx_HSCT_CONFIGPHY_Bits.PLLKPKI */
#define IFX_HSCT_CONFIGPHY_PLLKPKI_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_CONFIGPHY_Bits.PLLKPKI */
#define IFX_HSCT_CONFIGPHY_PLLKPKI_OFF (14u)

/** \brief  Length for Ifx_HSCT_CONFIGPHY_Bits.PLLPE */
#define IFX_HSCT_CONFIGPHY_PLLPE_LEN (6u)

/** \brief  Mask for Ifx_HSCT_CONFIGPHY_Bits.PLLPE */
#define IFX_HSCT_CONFIGPHY_PLLPE_MSK (0x3fu)

/** \brief  Offset for Ifx_HSCT_CONFIGPHY_Bits.PLLPE */
#define IFX_HSCT_CONFIGPHY_PLLPE_OFF (2u)

/** \brief  Length for Ifx_HSCT_CONFIGPHY_Bits.PLLPON */
#define IFX_HSCT_CONFIGPHY_PLLPON_LEN (1u)

/** \brief  Mask for Ifx_HSCT_CONFIGPHY_Bits.PLLPON */
#define IFX_HSCT_CONFIGPHY_PLLPON_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_CONFIGPHY_Bits.PLLPON */
#define IFX_HSCT_CONFIGPHY_PLLPON_OFF (1u)

/** \brief  Length for Ifx_HSCT_CONFIGPHY_Bits.PLLWMF */
#define IFX_HSCT_CONFIGPHY_PLLWMF_LEN (6u)

/** \brief  Mask for Ifx_HSCT_CONFIGPHY_Bits.PLLWMF */
#define IFX_HSCT_CONFIGPHY_PLLWMF_MSK (0x3fu)

/** \brief  Offset for Ifx_HSCT_CONFIGPHY_Bits.PLLWMF */
#define IFX_HSCT_CONFIGPHY_PLLWMF_OFF (8u)

/** \brief  Length for Ifx_HSCT_CTSCTRL_Bits.CTS_FRAME */
#define IFX_HSCT_CTSCTRL_CTS_FRAME_LEN (1u)

/** \brief  Mask for Ifx_HSCT_CTSCTRL_Bits.CTS_FRAME */
#define IFX_HSCT_CTSCTRL_CTS_FRAME_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_CTSCTRL_Bits.CTS_FRAME */
#define IFX_HSCT_CTSCTRL_CTS_FRAME_OFF (0u)

/** \brief  Length for Ifx_HSCT_CTSCTRL_Bits.CTS_RXD */
#define IFX_HSCT_CTSCTRL_CTS_RXD_LEN (1u)

/** \brief  Mask for Ifx_HSCT_CTSCTRL_Bits.CTS_RXD */
#define IFX_HSCT_CTSCTRL_CTS_RXD_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_CTSCTRL_Bits.CTS_RXD */
#define IFX_HSCT_CTSCTRL_CTS_RXD_OFF (2u)

/** \brief  Length for Ifx_HSCT_CTSCTRL_Bits.CTS_TXD */
#define IFX_HSCT_CTSCTRL_CTS_TXD_LEN (1u)

/** \brief  Mask for Ifx_HSCT_CTSCTRL_Bits.CTS_TXD */
#define IFX_HSCT_CTSCTRL_CTS_TXD_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_CTSCTRL_Bits.CTS_TXD */
#define IFX_HSCT_CTSCTRL_CTS_TXD_OFF (1u)

/** \brief  Length for Ifx_HSCT_CTSCTRL_Bits.HSSL_CTS_FBD */
#define IFX_HSCT_CTSCTRL_HSSL_CTS_FBD_LEN (1u)

/** \brief  Mask for Ifx_HSCT_CTSCTRL_Bits.HSSL_CTS_FBD */
#define IFX_HSCT_CTSCTRL_HSSL_CTS_FBD_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_CTSCTRL_Bits.HSSL_CTS_FBD */
#define IFX_HSCT_CTSCTRL_HSSL_CTS_FBD_OFF (3u)

/** \brief  Length for Ifx_HSCT_DISABLE_Bits.RX_DIS */
#define IFX_HSCT_DISABLE_RX_DIS_LEN (1u)

/** \brief  Mask for Ifx_HSCT_DISABLE_Bits.RX_DIS */
#define IFX_HSCT_DISABLE_RX_DIS_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_DISABLE_Bits.RX_DIS */
#define IFX_HSCT_DISABLE_RX_DIS_OFF (1u)

/** \brief  Length for Ifx_HSCT_DISABLE_Bits.RX_HEPD */
#define IFX_HSCT_DISABLE_RX_HEPD_LEN (1u)

/** \brief  Mask for Ifx_HSCT_DISABLE_Bits.RX_HEPD */
#define IFX_HSCT_DISABLE_RX_HEPD_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_DISABLE_Bits.RX_HEPD */
#define IFX_HSCT_DISABLE_RX_HEPD_OFF (2u)

/** \brief  Length for Ifx_HSCT_DISABLE_Bits.TX_DIS */
#define IFX_HSCT_DISABLE_TX_DIS_LEN (1u)

/** \brief  Mask for Ifx_HSCT_DISABLE_Bits.TX_DIS */
#define IFX_HSCT_DISABLE_TX_DIS_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_DISABLE_Bits.TX_DIS */
#define IFX_HSCT_DISABLE_TX_DIS_OFF (0u)

/** \brief  Length for Ifx_HSCT_ID_Bits.MOD_REV */
#define IFX_HSCT_ID_MOD_REV_LEN (8u)

/** \brief  Mask for Ifx_HSCT_ID_Bits.MOD_REV */
#define IFX_HSCT_ID_MOD_REV_MSK (0xffu)

/** \brief  Offset for Ifx_HSCT_ID_Bits.MOD_REV */
#define IFX_HSCT_ID_MOD_REV_OFF (0u)

/** \brief  Length for Ifx_HSCT_ID_Bits.MOD_TYPE */
#define IFX_HSCT_ID_MOD_TYPE_LEN (8u)

/** \brief  Mask for Ifx_HSCT_ID_Bits.MOD_TYPE */
#define IFX_HSCT_ID_MOD_TYPE_MSK (0xffu)

/** \brief  Offset for Ifx_HSCT_ID_Bits.MOD_TYPE */
#define IFX_HSCT_ID_MOD_TYPE_OFF (8u)

/** \brief  Length for Ifx_HSCT_ID_Bits.MODNUMBER */
#define IFX_HSCT_ID_MODNUMBER_LEN (16u)

/** \brief  Mask for Ifx_HSCT_ID_Bits.MODNUMBER */
#define IFX_HSCT_ID_MODNUMBER_MSK (0xffffu)

/** \brief  Offset for Ifx_HSCT_ID_Bits.MODNUMBER */
#define IFX_HSCT_ID_MODNUMBER_OFF (16u)

/** \brief  Length for Ifx_HSCT_IFCTRL_Bits.IFCVS */
#define IFX_HSCT_IFCTRL_IFCVS_LEN (8u)

/** \brief  Mask for Ifx_HSCT_IFCTRL_Bits.IFCVS */
#define IFX_HSCT_IFCTRL_IFCVS_MSK (0xffu)

/** \brief  Offset for Ifx_HSCT_IFCTRL_Bits.IFCVS */
#define IFX_HSCT_IFCTRL_IFCVS_OFF (0u)

/** \brief  Length for Ifx_HSCT_IFCTRL_Bits.IFTESTMD */
#define IFX_HSCT_IFCTRL_IFTESTMD_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IFCTRL_Bits.IFTESTMD */
#define IFX_HSCT_IFCTRL_IFTESTMD_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IFCTRL_Bits.IFTESTMD */
#define IFX_HSCT_IFCTRL_IFTESTMD_OFF (20u)

/** \brief  Length for Ifx_HSCT_IFCTRL_Bits.MRXSPEED */
#define IFX_HSCT_IFCTRL_MRXSPEED_LEN (2u)

/** \brief  Mask for Ifx_HSCT_IFCTRL_Bits.MRXSPEED */
#define IFX_HSCT_IFCTRL_MRXSPEED_MSK (0x3u)

/** \brief  Offset for Ifx_HSCT_IFCTRL_Bits.MRXSPEED */
#define IFX_HSCT_IFCTRL_MRXSPEED_OFF (16u)

/** \brief  Length for Ifx_HSCT_IFCTRL_Bits.MTXSPEED */
#define IFX_HSCT_IFCTRL_MTXSPEED_LEN (2u)

/** \brief  Mask for Ifx_HSCT_IFCTRL_Bits.MTXSPEED */
#define IFX_HSCT_IFCTRL_MTXSPEED_MSK (0x3u)

/** \brief  Offset for Ifx_HSCT_IFCTRL_Bits.MTXSPEED */
#define IFX_HSCT_IFCTRL_MTXSPEED_OFF (18u)

/** \brief  Length for Ifx_HSCT_IFCTRL_Bits.SIFCV */
#define IFX_HSCT_IFCTRL_SIFCV_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IFCTRL_Bits.SIFCV */
#define IFX_HSCT_IFCTRL_SIFCV_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IFCTRL_Bits.SIFCV */
#define IFX_HSCT_IFCTRL_SIFCV_OFF (8u)

/** \brief  Length for Ifx_HSCT_IFSTAT_Bits.RX_STAT */
#define IFX_HSCT_IFSTAT_RX_STAT_LEN (3u)

/** \brief  Mask for Ifx_HSCT_IFSTAT_Bits.RX_STAT */
#define IFX_HSCT_IFSTAT_RX_STAT_MSK (0x7u)

/** \brief  Offset for Ifx_HSCT_IFSTAT_Bits.RX_STAT */
#define IFX_HSCT_IFSTAT_RX_STAT_OFF (0u)

/** \brief  Length for Ifx_HSCT_IFSTAT_Bits.TX_STAT */
#define IFX_HSCT_IFSTAT_TX_STAT_LEN (2u)

/** \brief  Mask for Ifx_HSCT_IFSTAT_Bits.TX_STAT */
#define IFX_HSCT_IFSTAT_TX_STAT_MSK (0x3u)

/** \brief  Offset for Ifx_HSCT_IFSTAT_Bits.TX_STAT */
#define IFX_HSCT_IFSTAT_TX_STAT_OFF (3u)

/** \brief  Length for Ifx_HSCT_INIT_Bits.IFM */
#define IFX_HSCT_INIT_IFM_LEN (1u)

/** \brief  Mask for Ifx_HSCT_INIT_Bits.IFM */
#define IFX_HSCT_INIT_IFM_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_INIT_Bits.IFM */
#define IFX_HSCT_INIT_IFM_OFF (3u)

/** \brief  Length for Ifx_HSCT_INIT_Bits.LHLR */
#define IFX_HSCT_INIT_LHLR_LEN (1u)

/** \brief  Mask for Ifx_HSCT_INIT_Bits.LHLR */
#define IFX_HSCT_INIT_LHLR_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_INIT_Bits.LHLR */
#define IFX_HSCT_INIT_LHLR_OFF (10u)

/** \brief  Length for Ifx_HSCT_INIT_Bits.RXHD */
#define IFX_HSCT_INIT_RXHD_LEN (3u)

