luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxHsct_bf.h
/** \brief  Mask for Ifx_HSCT_INIT_Bits.RXHD */
#define IFX_HSCT_INIT_RXHD_MSK (0x7u)

/** \brief  Offset for Ifx_HSCT_INIT_Bits.RXHD */
#define IFX_HSCT_INIT_RXHD_OFF (19u)

/** \brief  Length for Ifx_HSCT_INIT_Bits.SRCF */
#define IFX_HSCT_INIT_SRCF_LEN (1u)

/** \brief  Mask for Ifx_HSCT_INIT_Bits.SRCF */
#define IFX_HSCT_INIT_SRCF_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_INIT_Bits.SRCF */
#define IFX_HSCT_INIT_SRCF_OFF (2u)

/** \brief  Length for Ifx_HSCT_INIT_Bits.SYS_CLK_EN */
#define IFX_HSCT_INIT_SYS_CLK_EN_LEN (1u)

/** \brief  Mask for Ifx_HSCT_INIT_Bits.SYS_CLK_EN */
#define IFX_HSCT_INIT_SYS_CLK_EN_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_INIT_Bits.SYS_CLK_EN */
#define IFX_HSCT_INIT_SYS_CLK_EN_OFF (1u)

/** \brief  Length for Ifx_HSCT_INIT_Bits.TXHD */
#define IFX_HSCT_INIT_TXHD_LEN (3u)

/** \brief  Mask for Ifx_HSCT_INIT_Bits.TXHD */
#define IFX_HSCT_INIT_TXHD_MSK (0x7u)

/** \brief  Offset for Ifx_HSCT_INIT_Bits.TXHD */
#define IFX_HSCT_INIT_TXHD_OFF (16u)

/** \brief  Length for Ifx_HSCT_IRQ_Bits.CER */
#define IFX_HSCT_IRQ_CER_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQ_Bits.CER */
#define IFX_HSCT_IRQ_CER_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQ_Bits.CER */
#define IFX_HSCT_IRQ_CER_OFF (3u)

/** \brief  Length for Ifx_HSCT_IRQ_Bits.HER */
#define IFX_HSCT_IRQ_HER_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQ_Bits.HER */
#define IFX_HSCT_IRQ_HER_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQ_Bits.HER */
#define IFX_HSCT_IRQ_HER_OFF (1u)

/** \brief  Length for Ifx_HSCT_IRQ_Bits.IFCFS */
#define IFX_HSCT_IRQ_IFCFS_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQ_Bits.IFCFS */
#define IFX_HSCT_IRQ_IFCFS_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQ_Bits.IFCFS */
#define IFX_HSCT_IRQ_IFCFS_OFF (4u)

/** \brief  Length for Ifx_HSCT_IRQ_Bits.PAR */
#define IFX_HSCT_IRQ_PAR_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQ_Bits.PAR */
#define IFX_HSCT_IRQ_PAR_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQ_Bits.PAR */
#define IFX_HSCT_IRQ_PAR_OFF (9u)

/** \brief  Length for Ifx_HSCT_IRQ_Bits.PLER */
#define IFX_HSCT_IRQ_PLER_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQ_Bits.PLER */
#define IFX_HSCT_IRQ_PLER_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQ_Bits.PLER */
#define IFX_HSCT_IRQ_PLER_OFF (7u)

/** \brief  Length for Ifx_HSCT_IRQ_Bits.PYER */
#define IFX_HSCT_IRQ_PYER_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQ_Bits.PYER */
#define IFX_HSCT_IRQ_PYER_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQ_Bits.PYER */
#define IFX_HSCT_IRQ_PYER_OFF (2u)

/** \brief  Length for Ifx_HSCT_IRQ_Bits.SFO */
#define IFX_HSCT_IRQ_SFO_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQ_Bits.SFO */
#define IFX_HSCT_IRQ_SFO_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQ_Bits.SFO */
#define IFX_HSCT_IRQ_SFO_OFF (11u)

/** \brief  Length for Ifx_HSCT_IRQ_Bits.SFU */
#define IFX_HSCT_IRQ_SFU_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQ_Bits.SFU */
#define IFX_HSCT_IRQ_SFU_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQ_Bits.SFU */
#define IFX_HSCT_IRQ_SFU_OFF (12u)

/** \brief  Length for Ifx_HSCT_IRQ_Bits.SMER */
#define IFX_HSCT_IRQ_SMER_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQ_Bits.SMER */
#define IFX_HSCT_IRQ_SMER_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQ_Bits.SMER */
#define IFX_HSCT_IRQ_SMER_OFF (5u)

/** \brief  Length for Ifx_HSCT_IRQ_Bits.TXTE */
#define IFX_HSCT_IRQ_TXTE_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQ_Bits.TXTE */
#define IFX_HSCT_IRQ_TXTE_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQ_Bits.TXTE */
#define IFX_HSCT_IRQ_TXTE_OFF (10u)

/** \brief  Length for Ifx_HSCT_IRQ_Bits.USM */
#define IFX_HSCT_IRQ_USM_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQ_Bits.USM */
#define IFX_HSCT_IRQ_USM_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQ_Bits.USM */
#define IFX_HSCT_IRQ_USM_OFF (8u)

/** \brief  Length for Ifx_HSCT_IRQ_Bits.USMSF */
#define IFX_HSCT_IRQ_USMSF_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQ_Bits.USMSF */
#define IFX_HSCT_IRQ_USMSF_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQ_Bits.USMSF */
#define IFX_HSCT_IRQ_USMSF_OFF (6u)

/** \brief  Length for Ifx_HSCT_IRQCLR_Bits.CERCLR */
#define IFX_HSCT_IRQCLR_CERCLR_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQCLR_Bits.CERCLR */
#define IFX_HSCT_IRQCLR_CERCLR_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQCLR_Bits.CERCLR */
#define IFX_HSCT_IRQCLR_CERCLR_OFF (3u)

/** \brief  Length for Ifx_HSCT_IRQCLR_Bits.HERCLR */
#define IFX_HSCT_IRQCLR_HERCLR_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQCLR_Bits.HERCLR */
#define IFX_HSCT_IRQCLR_HERCLR_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQCLR_Bits.HERCLR */
#define IFX_HSCT_IRQCLR_HERCLR_OFF (1u)

/** \brief  Length for Ifx_HSCT_IRQCLR_Bits.IFCFSCLR */
#define IFX_HSCT_IRQCLR_IFCFSCLR_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQCLR_Bits.IFCFSCLR */
#define IFX_HSCT_IRQCLR_IFCFSCLR_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQCLR_Bits.IFCFSCLR */
#define IFX_HSCT_IRQCLR_IFCFSCLR_OFF (4u)

/** \brief  Length for Ifx_HSCT_IRQCLR_Bits.PARCLR */
#define IFX_HSCT_IRQCLR_PARCLR_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQCLR_Bits.PARCLR */
#define IFX_HSCT_IRQCLR_PARCLR_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQCLR_Bits.PARCLR */
#define IFX_HSCT_IRQCLR_PARCLR_OFF (9u)

/** \brief  Length for Ifx_HSCT_IRQCLR_Bits.PLERCLR */
#define IFX_HSCT_IRQCLR_PLERCLR_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQCLR_Bits.PLERCLR */
#define IFX_HSCT_IRQCLR_PLERCLR_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQCLR_Bits.PLERCLR */
#define IFX_HSCT_IRQCLR_PLERCLR_OFF (7u)

/** \brief  Length for Ifx_HSCT_IRQCLR_Bits.PYERCLR */
#define IFX_HSCT_IRQCLR_PYERCLR_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQCLR_Bits.PYERCLR */
#define IFX_HSCT_IRQCLR_PYERCLR_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQCLR_Bits.PYERCLR */
#define IFX_HSCT_IRQCLR_PYERCLR_OFF (2u)

/** \brief  Length for Ifx_HSCT_IRQCLR_Bits.SFOCLR */
#define IFX_HSCT_IRQCLR_SFOCLR_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQCLR_Bits.SFOCLR */
#define IFX_HSCT_IRQCLR_SFOCLR_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQCLR_Bits.SFOCLR */
#define IFX_HSCT_IRQCLR_SFOCLR_OFF (11u)

/** \brief  Length for Ifx_HSCT_IRQCLR_Bits.SFUCLR */
#define IFX_HSCT_IRQCLR_SFUCLR_LEN (1u)

