luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxHsct_bf.h
/** \brief  Mask for Ifx_HSCT_IRQCLR_Bits.SFUCLR */
#define IFX_HSCT_IRQCLR_SFUCLR_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQCLR_Bits.SFUCLR */
#define IFX_HSCT_IRQCLR_SFUCLR_OFF (12u)

/** \brief  Length for Ifx_HSCT_IRQCLR_Bits.SMERCLR */
#define IFX_HSCT_IRQCLR_SMERCLR_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQCLR_Bits.SMERCLR */
#define IFX_HSCT_IRQCLR_SMERCLR_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQCLR_Bits.SMERCLR */
#define IFX_HSCT_IRQCLR_SMERCLR_OFF (5u)

/** \brief  Length for Ifx_HSCT_IRQCLR_Bits.TXTECLR */
#define IFX_HSCT_IRQCLR_TXTECLR_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQCLR_Bits.TXTECLR */
#define IFX_HSCT_IRQCLR_TXTECLR_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQCLR_Bits.TXTECLR */
#define IFX_HSCT_IRQCLR_TXTECLR_OFF (10u)

/** \brief  Length for Ifx_HSCT_IRQCLR_Bits.USMCLR */
#define IFX_HSCT_IRQCLR_USMCLR_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQCLR_Bits.USMCLR */
#define IFX_HSCT_IRQCLR_USMCLR_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQCLR_Bits.USMCLR */
#define IFX_HSCT_IRQCLR_USMCLR_OFF (8u)

/** \brief  Length for Ifx_HSCT_IRQCLR_Bits.USMSFCLR */
#define IFX_HSCT_IRQCLR_USMSFCLR_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQCLR_Bits.USMSFCLR */
#define IFX_HSCT_IRQCLR_USMSFCLR_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQCLR_Bits.USMSFCLR */
#define IFX_HSCT_IRQCLR_USMSFCLR_OFF (6u)

/** \brief  Length for Ifx_HSCT_IRQEN_Bits.CEREN */
#define IFX_HSCT_IRQEN_CEREN_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQEN_Bits.CEREN */
#define IFX_HSCT_IRQEN_CEREN_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQEN_Bits.CEREN */
#define IFX_HSCT_IRQEN_CEREN_OFF (3u)

/** \brief  Length for Ifx_HSCT_IRQEN_Bits.HEREN */
#define IFX_HSCT_IRQEN_HEREN_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQEN_Bits.HEREN */
#define IFX_HSCT_IRQEN_HEREN_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQEN_Bits.HEREN */
#define IFX_HSCT_IRQEN_HEREN_OFF (1u)

/** \brief  Length for Ifx_HSCT_IRQEN_Bits.IFCFSEN */
#define IFX_HSCT_IRQEN_IFCFSEN_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQEN_Bits.IFCFSEN */
#define IFX_HSCT_IRQEN_IFCFSEN_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQEN_Bits.IFCFSEN */
#define IFX_HSCT_IRQEN_IFCFSEN_OFF (4u)

/** \brief  Length for Ifx_HSCT_IRQEN_Bits.PAREN */
#define IFX_HSCT_IRQEN_PAREN_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQEN_Bits.PAREN */
#define IFX_HSCT_IRQEN_PAREN_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQEN_Bits.PAREN */
#define IFX_HSCT_IRQEN_PAREN_OFF (9u)

/** \brief  Length for Ifx_HSCT_IRQEN_Bits.PLEREN */
#define IFX_HSCT_IRQEN_PLEREN_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQEN_Bits.PLEREN */
#define IFX_HSCT_IRQEN_PLEREN_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQEN_Bits.PLEREN */
#define IFX_HSCT_IRQEN_PLEREN_OFF (7u)

/** \brief  Length for Ifx_HSCT_IRQEN_Bits.PYEREN */
#define IFX_HSCT_IRQEN_PYEREN_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQEN_Bits.PYEREN */
#define IFX_HSCT_IRQEN_PYEREN_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQEN_Bits.PYEREN */
#define IFX_HSCT_IRQEN_PYEREN_OFF (2u)

/** \brief  Length for Ifx_HSCT_IRQEN_Bits.SFOEN */
#define IFX_HSCT_IRQEN_SFOEN_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQEN_Bits.SFOEN */
#define IFX_HSCT_IRQEN_SFOEN_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQEN_Bits.SFOEN */
#define IFX_HSCT_IRQEN_SFOEN_OFF (11u)

/** \brief  Length for Ifx_HSCT_IRQEN_Bits.SFUEN */
#define IFX_HSCT_IRQEN_SFUEN_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQEN_Bits.SFUEN */
#define IFX_HSCT_IRQEN_SFUEN_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQEN_Bits.SFUEN */
#define IFX_HSCT_IRQEN_SFUEN_OFF (12u)

/** \brief  Length for Ifx_HSCT_IRQEN_Bits.SMEREN */
#define IFX_HSCT_IRQEN_SMEREN_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQEN_Bits.SMEREN */
#define IFX_HSCT_IRQEN_SMEREN_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQEN_Bits.SMEREN */
#define IFX_HSCT_IRQEN_SMEREN_OFF (5u)

/** \brief  Length for Ifx_HSCT_IRQEN_Bits.TXTEEN */
#define IFX_HSCT_IRQEN_TXTEEN_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQEN_Bits.TXTEEN */
#define IFX_HSCT_IRQEN_TXTEEN_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQEN_Bits.TXTEEN */
#define IFX_HSCT_IRQEN_TXTEEN_OFF (10u)

/** \brief  Length for Ifx_HSCT_IRQEN_Bits.USMEN */
#define IFX_HSCT_IRQEN_USMEN_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQEN_Bits.USMEN */
#define IFX_HSCT_IRQEN_USMEN_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQEN_Bits.USMEN */
#define IFX_HSCT_IRQEN_USMEN_OFF (8u)

/** \brief  Length for Ifx_HSCT_IRQEN_Bits.USMSFEN */
#define IFX_HSCT_IRQEN_USMSFEN_LEN (1u)

/** \brief  Mask for Ifx_HSCT_IRQEN_Bits.USMSFEN */
#define IFX_HSCT_IRQEN_USMSFEN_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_IRQEN_Bits.USMSFEN */
#define IFX_HSCT_IRQEN_USMSFEN_OFF (6u)

/** \brief  Length for Ifx_HSCT_KRST0_Bits.RST */
#define IFX_HSCT_KRST0_RST_LEN (1u)

/** \brief  Mask for Ifx_HSCT_KRST0_Bits.RST */
#define IFX_HSCT_KRST0_RST_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_KRST0_Bits.RST */
#define IFX_HSCT_KRST0_RST_OFF (0u)

/** \brief  Length for Ifx_HSCT_KRST0_Bits.RSTSTAT */
#define IFX_HSCT_KRST0_RSTSTAT_LEN (1u)

/** \brief  Mask for Ifx_HSCT_KRST0_Bits.RSTSTAT */
#define IFX_HSCT_KRST0_RSTSTAT_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_KRST0_Bits.RSTSTAT */
#define IFX_HSCT_KRST0_RSTSTAT_OFF (1u)

/** \brief  Length for Ifx_HSCT_KRST1_Bits.RST */
#define IFX_HSCT_KRST1_RST_LEN (1u)

/** \brief  Mask for Ifx_HSCT_KRST1_Bits.RST */
#define IFX_HSCT_KRST1_RST_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_KRST1_Bits.RST */
#define IFX_HSCT_KRST1_RST_OFF (0u)

/** \brief  Length for Ifx_HSCT_KRSTCLR_Bits.CLR */
#define IFX_HSCT_KRSTCLR_CLR_LEN (1u)

/** \brief  Mask for Ifx_HSCT_KRSTCLR_Bits.CLR */
#define IFX_HSCT_KRSTCLR_CLR_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_KRSTCLR_Bits.CLR */
#define IFX_HSCT_KRSTCLR_CLR_OFF (0u)

/** \brief  Length for Ifx_HSCT_OCS_Bits.SUS */
#define IFX_HSCT_OCS_SUS_LEN (4u)

/** \brief  Mask for Ifx_HSCT_OCS_Bits.SUS */
#define IFX_HSCT_OCS_SUS_MSK (0xfu)

/** \brief  Offset for Ifx_HSCT_OCS_Bits.SUS */
#define IFX_HSCT_OCS_SUS_OFF (24u)

/** \brief  Length for Ifx_HSCT_OCS_Bits.SUS_P */
#define IFX_HSCT_OCS_SUS_P_LEN (1u)

/** \brief  Mask for Ifx_HSCT_OCS_Bits.SUS_P */
#define IFX_HSCT_OCS_SUS_P_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_OCS_Bits.SUS_P */
#define IFX_HSCT_OCS_SUS_P_OFF (28u)

/** \brief  Length for Ifx_HSCT_OCS_Bits.SUSSTA */
#define IFX_HSCT_OCS_SUSSTA_LEN (1u)

/** \brief  Mask for Ifx_HSCT_OCS_Bits.SUSSTA */
#define IFX_HSCT_OCS_SUSSTA_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_OCS_Bits.SUSSTA */
#define IFX_HSCT_OCS_SUSSTA_OFF (29u)

/** \brief  Length for Ifx_HSCT_OCS_Bits.TG_P */
#define IFX_HSCT_OCS_TG_P_LEN (1u)

/** \brief  Mask for Ifx_HSCT_OCS_Bits.TG_P */
#define IFX_HSCT_OCS_TG_P_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_OCS_Bits.TG_P */
#define IFX_HSCT_OCS_TG_P_OFF (3u)

/** \brief  Length for Ifx_HSCT_OCS_Bits.TGB */
#define IFX_HSCT_OCS_TGB_LEN (1u)

/** \brief  Mask for Ifx_HSCT_OCS_Bits.TGB */
#define IFX_HSCT_OCS_TGB_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_OCS_Bits.TGB */
#define IFX_HSCT_OCS_TGB_OFF (2u)

/** \brief  Length for Ifx_HSCT_OCS_Bits.TGS */
#define IFX_HSCT_OCS_TGS_LEN (2u)

