luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxHsct_bf.h
/** \brief  Mask for Ifx_HSCT_OCS_Bits.TGS */
#define IFX_HSCT_OCS_TGS_MSK (0x3u)

/** \brief  Offset for Ifx_HSCT_OCS_Bits.TGS */
#define IFX_HSCT_OCS_TGS_OFF (0u)

/** \brief  Length for Ifx_HSCT_SLEEPCTRL_Bits.SLPCLKG */
#define IFX_HSCT_SLEEPCTRL_SLPCLKG_LEN (1u)

/** \brief  Mask for Ifx_HSCT_SLEEPCTRL_Bits.SLPCLKG */
#define IFX_HSCT_SLEEPCTRL_SLPCLKG_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_SLEEPCTRL_Bits.SLPCLKG */
#define IFX_HSCT_SLEEPCTRL_SLPCLKG_OFF (1u)

/** \brief  Length for Ifx_HSCT_SLEEPCTRL_Bits.SLPEN */
#define IFX_HSCT_SLEEPCTRL_SLPEN_LEN (1u)

/** \brief  Mask for Ifx_HSCT_SLEEPCTRL_Bits.SLPEN */
#define IFX_HSCT_SLEEPCTRL_SLPEN_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_SLEEPCTRL_Bits.SLPEN */
#define IFX_HSCT_SLEEPCTRL_SLPEN_OFF (0u)

/** \brief  Length for Ifx_HSCT_STAT_Bits.LIFCCMDR */
#define IFX_HSCT_STAT_LIFCCMDR_LEN (8u)

/** \brief  Mask for Ifx_HSCT_STAT_Bits.LIFCCMDR */
#define IFX_HSCT_STAT_LIFCCMDR_MSK (0xffu)

/** \brief  Offset for Ifx_HSCT_STAT_Bits.LIFCCMDR */
#define IFX_HSCT_STAT_LIFCCMDR_OFF (24u)

/** \brief  Length for Ifx_HSCT_STAT_Bits.RX_CHANNEL */
#define IFX_HSCT_STAT_RX_CHANNEL_LEN (4u)

/** \brief  Mask for Ifx_HSCT_STAT_Bits.RX_CHANNEL */
#define IFX_HSCT_STAT_RX_CHANNEL_MSK (0xfu)

/** \brief  Offset for Ifx_HSCT_STAT_Bits.RX_CHANNEL */
#define IFX_HSCT_STAT_RX_CHANNEL_OFF (3u)

/** \brief  Length for Ifx_HSCT_STAT_Bits.RX_PSIZE */
#define IFX_HSCT_STAT_RX_PSIZE_LEN (3u)

/** \brief  Mask for Ifx_HSCT_STAT_Bits.RX_PSIZE */
#define IFX_HSCT_STAT_RX_PSIZE_MSK (0x7u)

/** \brief  Offset for Ifx_HSCT_STAT_Bits.RX_PSIZE */
#define IFX_HSCT_STAT_RX_PSIZE_OFF (0u)

/** \brief  Length for Ifx_HSCT_STAT_Bits.RX_SLEEP */
#define IFX_HSCT_STAT_RX_SLEEP_LEN (1u)

/** \brief  Mask for Ifx_HSCT_STAT_Bits.RX_SLEEP */
#define IFX_HSCT_STAT_RX_SLEEP_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_STAT_Bits.RX_SLEEP */
#define IFX_HSCT_STAT_RX_SLEEP_OFF (7u)

/** \brief  Length for Ifx_HSCT_STAT_Bits.TX_CHANNEL_TYPE */
#define IFX_HSCT_STAT_TX_CHANNEL_TYPE_LEN (4u)

/** \brief  Mask for Ifx_HSCT_STAT_Bits.TX_CHANNEL_TYPE */
#define IFX_HSCT_STAT_TX_CHANNEL_TYPE_MSK (0xfu)

/** \brief  Offset for Ifx_HSCT_STAT_Bits.TX_CHANNEL_TYPE */
#define IFX_HSCT_STAT_TX_CHANNEL_TYPE_OFF (16u)

/** \brief  Length for Ifx_HSCT_STAT_Bits.TX_PSIZE */
#define IFX_HSCT_STAT_TX_PSIZE_LEN (3u)

/** \brief  Mask for Ifx_HSCT_STAT_Bits.TX_PSIZE */
#define IFX_HSCT_STAT_TX_PSIZE_MSK (0x7u)

/** \brief  Offset for Ifx_HSCT_STAT_Bits.TX_PSIZE */
#define IFX_HSCT_STAT_TX_PSIZE_OFF (12u)

/** \brief  Length for Ifx_HSCT_STAT_Bits.TX_SLEEP */
#define IFX_HSCT_STAT_TX_SLEEP_LEN (1u)

/** \brief  Mask for Ifx_HSCT_STAT_Bits.TX_SLEEP */
#define IFX_HSCT_STAT_TX_SLEEP_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_STAT_Bits.TX_SLEEP */
#define IFX_HSCT_STAT_TX_SLEEP_OFF (8u)

/** \brief  Length for Ifx_HSCT_STATPHY_Bits.PLOCK */
#define IFX_HSCT_STATPHY_PLOCK_LEN (1u)

/** \brief  Mask for Ifx_HSCT_STATPHY_Bits.PLOCK */
#define IFX_HSCT_STATPHY_PLOCK_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_STATPHY_Bits.PLOCK */
#define IFX_HSCT_STATPHY_PLOCK_OFF (0u)

/** \brief  Length for Ifx_HSCT_STATPHY_Bits.RXLSA */
#define IFX_HSCT_STATPHY_RXLSA_LEN (1u)

/** \brief  Mask for Ifx_HSCT_STATPHY_Bits.RXLSA */
#define IFX_HSCT_STATPHY_RXLSA_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_STATPHY_Bits.RXLSA */
#define IFX_HSCT_STATPHY_RXLSA_OFF (1u)

/** \brief  Length for Ifx_HSCT_STATPHY_Bits.TXLSA */
#define IFX_HSCT_STATPHY_TXLSA_LEN (1u)

/** \brief  Mask for Ifx_HSCT_STATPHY_Bits.TXLSA */
#define IFX_HSCT_STATPHY_TXLSA_MSK (0x1u)

/** \brief  Offset for Ifx_HSCT_STATPHY_Bits.TXLSA */
#define IFX_HSCT_STATPHY_TXLSA_OFF (2u)

/** \brief  Length for Ifx_HSCT_USMR_Bits.USMR */
#define IFX_HSCT_USMR_USMR_LEN (32u)

/** \brief  Mask for Ifx_HSCT_USMR_Bits.USMR */
#define IFX_HSCT_USMR_USMR_MSK (0xffffffffu)

/** \brief  Offset for Ifx_HSCT_USMR_Bits.USMR */
#define IFX_HSCT_USMR_USMR_OFF (0u)

/** \brief  Length for Ifx_HSCT_USMS_Bits.USMS */
#define IFX_HSCT_USMS_USMS_LEN (32u)

/** \brief  Mask for Ifx_HSCT_USMS_Bits.USMS */
#define IFX_HSCT_USMS_USMS_MSK (0xffffffffu)

/** \brief  Offset for Ifx_HSCT_USMS_Bits.USMS */
#define IFX_HSCT_USMS_USMS_OFF (0u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXHSCT_BF_H */
